ninety_nine_cats/app/views/cats/show.html.erb

SELECT "cat_rental_requests".* FROM "cat_rental_requests"
---
<br>
<% CatRentalRequest.sorted.each do |request| %>