ninety_nine_cats/app/views/cat_rental_requests/new.html.erb

SELECT "cats".* FROM "cats"
---
    <select name="cat_rental_request[cat_id]" id="cat_id">
        <% Cat.all.each do |cat| %>