ninety_nine_cats/app/controllers/cat_rental_requests_controller.rb

INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 1], ["start_date", "2019-10-08"], ["end_date", "2019-10-30"], ["created_at", "2019-10-06 07:45:03.966565"], ["updated_at", "2019-10-06 07:45:03.966565"]]
---
  def create
    @cat_rental_request = CatRentalRequest.new(cat_rental_request_params)
    if @cat_rental_request.save

SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def approve
    @cat_rental_request = CatRentalRequest.find_by(id: params[:id])

SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def deny
    @cat_rental_request = CatRentalRequest.find_by(id: params[:id])