ninety_nine_cats/app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["color", "orange"], ["description", "  s\r\n  "], ["updated_at", "2019-10-06 00:15:29.612538"], ["id", 4]]
---
  def update
    @cat = Cat.find_by(id: params[:id])
    if @cat
      if @cat.update_attributes(cat_params)