ninety_nine_cats/app/models/cat_rental_request.rb

SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE NOT (start_date > '2019-10-08' OR end_date < '2019-10-30') AND "cat_rental_requests"."id" != $1 AND "cat_rental_requests"."cat_id" = $2 AND "cat_rental_requests"."status" = $3  [["id", 1], ["cat_id", 1], ["status", "PENDING"]]
---
  def overlapping_approved_requests
    overlapping_requests.where(status: 'APPROVED')