ninety_nine_cats/app/models/cat_rental_request.rb

UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "APPROVED"], ["updated_at", "2019-10-06 09:00:05.844073"], ["id", 7]]
---
  def approve!
    CatRentalRequest.transaction do
      self.status = 'APPROVED'
      self.save!

UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2019-10-06 09:04:37.573538"], ["id", 13]]
---
  def deny!
    self.status = 'DENIED'
    self.save!